arribada/horizon-v3-firmware/ports/nrf52840/syshal/syshal_ble.c
/**
  ******************************************************************************
  * @file     syshal_ble.c
  * @brief    System hardware abstraction layer for BLE
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Arribada</center></h2>
  *
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <https://www.gnu.org/licenses/>.
  *
  ******************************************************************************
  */

#include <string.h> // memset()
#include "amt.h"
#include "syshal_ble.h"
#include "sys_config.h"
#include "app_error.h"
#include "sdk_errors.h"
#include "ble_advdata.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "ble_db_discovery.h"
#include "debug.h"



#define APP_BLE_CONN_CFG_TAG   1  /**< A tag that refers to the BLE stack configuration. */
#define APP_BLE_OBSERVER_PRIO  3  /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define CONN_INTERVAL_DEFAULT           (uint16_t)(MSEC_TO_UNITS(7.5, UNIT_1_25_MS))    /**< Default connection interval used at connection establishment by central side. */
#define CONN_INTERVAL_MIN               (uint16_t)(MSEC_TO_UNITS(7.5, UNIT_1_25_MS))    /**< Minimum acceptable connection interval, in 1.25 ms units. */
#define CONN_INTERVAL_MAX               (uint16_t)(MSEC_TO_UNITS(500, UNIT_1_25_MS))    /**< Maximum acceptable connection interval, in 1.25 ms units. */
#define ADV_INTERVAL_DEFAULT            (uint16_t)(MSEC_TO_UNITS(20.0,   UNIT_0_625_MS)) /**< Default connection interval used at connection establishment by central side. */
#define ADV_INTERVAL_MIN                (uint16_t)(MSEC_TO_UNITS(20.0,   UNIT_0_625_MS)) /**< Minimum acceptable advertising interval, in 0.625 ms units. */
#define ADV_INTERVAL_MAX                (uint16_t)(MSEC_TO_UNITS(4000.0, UNIT_0_625_MS)) /**< Maximum acceptable advertising interval, in 0.625 ms units. */
#define CONN_SUP_TIMEOUT                (uint16_t)(MSEC_TO_UNITS(4000,  UNIT_10_MS))    /**< Connection supervisory timeout (4 seconds). */
#define SLAVE_LATENCY                   0                                               /**< Slave latency. */
#define DEVICE_NAME "Arribada_Tracker"

static nrf_ble_amts_t     m_amts;

NRF_BLE_GATT_DEF(m_gatt);                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                         /**< Context for the Queued Write module.*/
BLE_DB_DISCOVERY_DEF(m_ble_db_discovery);       /**< DB discovery module instance. */
NRF_SDH_BLE_OBSERVER(m_amts_ble_obs, BLE_AMTS_BLE_OBSERVER_PRIO, nrf_ble_amts_on_ble_evt, &m_amts);


static volatile bool currently_advertising = false;                                     /**< Are we currently advertising? */
static volatile bool currently_connected = false;
static volatile bool m_notif_enabled;
static volatile bool m_mtu_exchanged;
static volatile bool m_data_length_updated;
static volatile bool m_phy_updated;
static volatile bool m_conn_interval_configured;
static bool m_ble_stack_initalised;
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current BLE connection .*/
static uint8_t m_gap_role     = BLE_GAP_ROLE_INVALID;       /**< BLE role for this connection, see @ref BLE_GAP_ROLES */
static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                           /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                            /**< Buffer for storing an encoded advertising set. */

static volatile bool rx_pending;
static uint8_t * rx_buffer;
static uint32_t rx_length;

static volatile bool tx_pending;
static uint32_t tx_length;

// Test parameters.
typedef struct
{
    uint16_t        att_mtu;                    /**< GATT ATT MTU, in bytes. */
    uint16_t        advertising_interval;       /**< Advertising interval expressed in units of 0.625 ms. */
    uint16_t        conn_interval;              /**< Connection interval expressed in units of 1.25 ms. */
    ble_gap_phys_t  phys;                       /**< Preferred PHYs. */
    uint8_t         data_len;                   /**< Data length. */
    bool            conn_evt_len_ext_enabled;   /**< Connection event length extension status. */
} ble_params_t;
// Settings like ATT MTU size are set only once on the dummy board.
// Make sure that defaults are sensible.
static ble_params_t m_ble_params =
{
    .att_mtu                  = NRF_SDH_BLE_GATT_MAX_MTU_SIZE,
    .data_len                 = NRF_SDH_BLE_GAP_DATA_LENGTH,
    .advertising_interval     = ADV_INTERVAL_DEFAULT,
    .conn_interval            = CONN_INTERVAL_DEFAULT,
    .conn_evt_len_ext_enabled = true,
    .phys.tx_phys             = BLE_GAP_PHY_1MBPS,
    .phys.rx_phys             = BLE_GAP_PHY_1MBPS,
};

// Connection parameters requested for connection.
static ble_gap_conn_params_t m_conn_param =
{
    .min_conn_interval = CONN_INTERVAL_MIN,   // Minimum connection interval.
    .max_conn_interval = CONN_INTERVAL_MAX,   // Maximum connection interval.
    .slave_latency     = SLAVE_LATENCY,       // Slave latency.
    .conn_sup_timeout  = CONN_SUP_TIMEOUT     // Supervisory timeout.
};

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = NULL,
        .len    = 0

