arribada/horizon-v3-firmware/ports/nrf52840/syshal/syshal_ble.c
    }
};

static char const * phy_str(ble_gap_phys_t phys);
static void amts_evt_handler(nrf_ble_amts_evt_t evt);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt);
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void gatt_mtu_set(uint16_t att_mtu);
static void advertising_data_set(void);
static void advertising_start(void);
static void advertising_stop(void);
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt);
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt);
static void qwr_init(void);
static void server_init(void);
static void data_len_set(uint8_t value);
static void conn_evt_len_ext_set(bool status);

char const * phy_str(ble_gap_phys_t phys)
{
    static char const * str[] =
    {
        "1 Mbps",
        "2 Mbps",
        "Coded",
        "Unknown"
    };

    switch (phys.tx_phys)
    {
        case BLE_GAP_PHY_1MBPS:
            return str[0];

        case BLE_GAP_PHY_2MBPS:
            return str[1];

        case BLE_GAP_PHY_CODED:
            return str[2];

        default:
            return str[3];
    }
}

/**@brief AMT server event handler. */
static void amts_evt_handler(nrf_ble_amts_evt_t evt)
{
    ret_code_t err_code;

    switch (evt.evt_type)
    {
        case NRF_BLE_AMTS_EVT_NOTIF_ENABLED:
        {
            DEBUG_PR_TRACE("Notifications enabled.");

            m_notif_enabled = true;

            if (m_ble_params.conn_interval != CONN_INTERVAL_DEFAULT)
            {
                DEBUG_PR_TRACE("Updating connection parameters..");
                m_conn_param.min_conn_interval = m_ble_params.conn_interval;
                m_conn_param.max_conn_interval = m_ble_params.conn_interval;
                err_code = sd_ble_gap_conn_param_update(m_conn_handle, &m_conn_param);

                if (err_code != NRF_SUCCESS)
                {
                    DEBUG_PR_ERROR("sd_ble_gap_conn_param_update() failed: 0x%08lX", err_code);
                }
            }
            else
            {
                m_conn_interval_configured = true;
            }
        } break;

        case NRF_BLE_AMTS_EVT_NOTIF_DISABLED:
        {
            DEBUG_PR_TRACE("Notifications disabled.");
        } break;

        case NRF_BLE_AMTS_EVT_TX_COMPLETE:
        {
            DEBUG_PR_TRACE("TX Complete.");

            // Notify the application that we have sent the buffer
            syshal_ble_event_t event =
            {
                .error = SYSHAL_BLE_NO_ERROR,
                .id = SYSHAL_BLE_EVENT_SEND_COMPLETE,
                .send_complete = {
                    .length = tx_length
                }
            };

            // Reset pending buffer
            tx_pending = false;
            syshal_ble_event_handler(&event);
        } break;

        case NRF_BLE_AMTS_EVT_RX_COMPLETE:
        {
            //DEBUG_PR_TRACE("RX Complete.");

            if (!rx_pending)
            {
                DEBUG_PR_ERROR("BLE Data received before syshal_ble_receive() was called. Data lost!");
                return;
            }

            if (evt.receive_complete.length > rx_length)
            {
                DEBUG_PR_ERROR("BLE Data received but buffer for it too small. Data lost!");
                return;
            }

            // Copy the received data into the receive buffer
            memcpy(rx_buffer, evt.receive_complete.buffer, evt.receive_complete.length);

            // Notify the application that we have sent the buffer
            syshal_ble_event_t event =
            {
                .error = SYSHAL_BLE_NO_ERROR,
                .id = SYSHAL_BLE_EVENT_RECEIVE_COMPLETE,
                .receive_complete = {
                    .length = evt.receive_complete.length
                }
            };

            // Reset pending buffer
            rx_pending = false;
            syshal_ble_event_handler(&event);
        } break;

    }
}

/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t              err_code;
    syshal_ble_event_t    event;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            //on_adv_report(&p_gap_evt->params.adv_report);
            break;

        case BLE_GAP_EVT_CONNECTED:
            currently_advertising = false;
            on_ble_gap_evt_connected(p_gap_evt);
            currently_connected = true;
            // Notify the application that we have connected
            event.id = SYSHAL_BLE_EVENT_CONNECTED;
            syshal_ble_event_handler(&event);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            currently_connected = false;
            // Notify the application that we have disconnected
            event.id = SYSHAL_BLE_EVENT_DISCONNECTED;
            syshal_ble_event_handler(&event);

            on_ble_gap_evt_disconnected(p_gap_evt);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        {
            m_conn_interval_configured = true;
            DEBUG_PR_TRACE("Connection interval updated: 0x%x, 0x%x.",
                           p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
                           p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            // Accept parameters requested by the peer.
            ble_gap_conn_params_t params;
            params = p_gap_evt->params.conn_param_update_request.conn_params;
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
            APP_ERROR_CHECK(err_code);

            DEBUG_PR_TRACE("Connection interval updated (upon request): 0x%x, 0x%x.",
                           p_gap_evt->params.conn_param_update_request.conn_params.min_conn_interval,
                           p_gap_evt->params.conn_param_update_request.conn_params.max_conn_interval);
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        {
            err_code = sd_ble_gatts_sys_attr_set(p_gap_evt->conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
        } break;

