arribada/horizon-v3-firmware/ports/nrf52840/syshal/syshal_ble.c
        .primary_phy   = BLE_GAP_PHY_1MBPS, // Must be changed to connect in long range. (BLE_GAP_PHY_CODED)
        .secondary_phy = BLE_GAP_PHY_1MBPS,
    };

    ble_advdata_t const adv_data =
    {
        .name_type          = BLE_ADVDATA_FULL_NAME,
        .flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
    };

    ret = ble_advdata_encode(&adv_data, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(ret);

    ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(ret);
}

/**@brief Function for starting advertising. */
static void advertising_start(void)
{
    if (!currently_advertising)
    {
        DEBUG_PR_TRACE("Starting advertising.");

        ret_code_t err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);

        if (NRF_SUCCESS == err_code)
            currently_advertising = true;

        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for stopping advertising. */
static void advertising_stop(void)
{
    if (currently_advertising)
    {
        DEBUG_PR_TRACE("Stopping advertising.");

        ret_code_t err_code = sd_ble_gap_adv_stop(m_adv_handle);
        currently_advertising = false;

        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role, then discover the peer DB.
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
    ret_code_t err_code;

    m_conn_handle = p_gap_evt->conn_handle;
    m_gap_role    = p_gap_evt->params.connected.role;

    if (m_gap_role == BLE_GAP_ROLE_PERIPH)
    {
        DEBUG_PR_TRACE("Connected as a peripheral.");
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_STATE); // We've somehow connected as a central device
    }

    // Stop advertising.
    (void) sd_ble_gap_adv_stop(m_adv_handle);

    // Assign connection handle to the Queued Write module.
    err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
    APP_ERROR_CHECK(err_code);

    if (m_gap_role == BLE_GAP_ROLE_PERIPH)
    {
        DEBUG_PR_TRACE("Sending PHY Update, %s.", phy_str(m_ble_params.phys));

        err_code = sd_ble_gap_phy_update(p_gap_evt->conn_handle, &m_ble_params.phys);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and terminate the test.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt)
{
    m_conn_handle = BLE_CONN_HANDLE_INVALID;

    DEBUG_PR_TRACE("Disconnected: reason 0x%x.", p_gap_evt->params.disconnected.reason);

    m_notif_enabled            = false;
    m_mtu_exchanged            = false;
    m_data_length_updated      = false;
    m_phy_updated              = false;
    m_conn_interval_configured = false;

    // If we didn't terminate the connection ourselves
    if (BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION != p_gap_evt->params.disconnected.reason)
        advertising_start(); // Then start advertising again
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Queued Write module.
 */
static void qwr_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init_obj = {0};

    // Initialize Queued Write Module.
    qwr_init_obj.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init_obj);
    APP_ERROR_CHECK(err_code);
}

static void server_init(void)
{
    if (m_ble_stack_initalised)
        return;

    qwr_init();
    nrf_ble_amts_init(&m_amts, amts_evt_handler);
}

static void data_len_set(uint8_t value)
{
    ret_code_t err_code;
    err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, value);
    APP_ERROR_CHECK(err_code);

    m_ble_params.data_len = value;
}

static void conn_evt_len_ext_set(bool status)
{
    ret_code_t err_code;
    ble_opt_t  opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = status ? 1 : 0;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);

    m_ble_params.conn_evt_len_ext_enabled = status;
}

int syshal_ble_init(void)
{
    DEBUG_PR_TRACE("ble_stack_init");
    ble_stack_init();
    DEBUG_PR_TRACE("gap_params_init");
    gap_params_init();
    DEBUG_PR_TRACE("gatt_init");
    gatt_init();
    DEBUG_PR_TRACE("advertising_data_set");
    advertising_data_set();

    DEBUG_PR_TRACE("server_init");
    server_init();

    m_ble_stack_initalised = true;

    // Set a custom address if we have one
    if (sys_config.tag_bluetooth_device_address.hdr.set)
    {
        ble_gap_addr_t address;

        for (uint32_t i = 0; i < BLE_GAP_ADDR_LEN; ++i)
            address.addr[i] = sys_config.tag_bluetooth_device_address.contents.address[i];

        address.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
        address.addr[5] |= ((1 << 7) | (1 << 6)); // The top 2 bits must be set in Private address mode

        sd_ble_gap_addr_set(&address);
    }

    gatt_mtu_set(m_ble_params.att_mtu);
    conn_evt_len_ext_set(m_ble_params.conn_evt_len_ext_enabled);

    data_len_set(251);

    advertising_start();

    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_term(void)
{
    // Stop advertising if we were
    advertising_stop();

    // Disconnect if we were connected
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        DEBUG_PR_TRACE("Disconnecting...");

        ret_code_t err_code;
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        if (err_code != NRF_SUCCESS)
            DEBUG_PR_ERROR("sd_ble_gap_disconnect() failed: 0x%08lX", err_code);
    }

    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_set_mode(syshal_ble_mode_t mode)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_get_mode(syshal_ble_mode_t *mode)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_get_version(uint32_t *version)
{
//    ble_version_t ble_version;
//
//    if (!nrf_sdh_is_enabled())
//        return SYSHAL_BLE_ERROR_FAIL;
//
//    if (sd_ble_version_get(&ble_version))
//        return SYSHAL_BLE_ERROR_FAIL;
//
//    *version = ble_version.subversion_number;

    // Access the version using direct memory access
    // This is necessary as sd_ble_version_get() fails if 
    // nrf_sdh_ble_enable() has not been called

    *version = *(uint16_t*) 0x0000300C;

    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_config_fw_upgrade(uint32_t size, uint32_t crc)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_fw_send(uint8_t * data, uint32_t size)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_reset(void)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_send(uint8_t *buffer, uint32_t size)
{
    if (!currently_connected)
        return SYSHAL_BLE_ERROR_DISCONNECTED;

    // Only allow sending if notifications on the server have been enabled
    if (!m_notif_enabled)
        return SYSHAL_BLE_ERROR_FORBIDDEN;

    if (tx_pending)
        return SYSHAL_BLE_ERROR_BUSY;

    tx_pending = true;
    tx_length = size;
    return nrf_ble_amts_send(&m_amts, buffer, size);
}

int syshal_ble_receive(uint8_t *buffer, uint32_t size)
{
    if (!currently_connected)
        return SYSHAL_BLE_ERROR_DISCONNECTED;

    if (rx_pending)
        return SYSHAL_BLE_ERROR_BUSY;

    rx_pending = true;
    rx_buffer = buffer;
    rx_length = size;

    return SYSHAL_BLE_NO_ERROR;
}

int syshal_ble_tick(void)
{
    return SYSHAL_BLE_NO_ERROR;
}

__attribute__((weak)) int syshal_ble_event_handler(syshal_ble_event_t * event)
{
    DEBUG_PR_WARN("%s Not implemented", __FUNCTION__);
    return SYSHAL_BLE_NO_ERROR;
}